app/controllers/heros_controller.rb

    def index
        heros = Hero.all
---
SELECT "heros".* FROM "heros"

    def show
        hero = Hero.find_by(id: params[:id])
---
SELECT "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]